modified documents, yaml, and css file to work with MKdoc and Materials
